In [1]:
import pandas as pd

In [2]:
Data=pd.read_csv("CRO.csv")

# Axis parameter in pandas

In [3]:
Data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

In [5]:
Data.drop("country",axis=1).head()

   age  new_user source  total_pages_visited  converted
0   25         1    Ads                    1          0
1   23         1    Seo                    5          0
2   28         1    Seo                    4          0
3   39         1    Seo                    5          0
4   30         1    Seo                    6          0

In [6]:
Data.drop(2,axis=0).head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0
5      US   31         0    Seo                    1          0

In [7]:
#conclusion:
#axis=1-------------->column
#axis=0-------------->Row

In [10]:
Data.shape

(316200, 6)

In [13]:
data=Data.iloc[1:7,:]

In [14]:
data

  country  age  new_user source  total_pages_visited  converted
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0
5      US   31         0    Seo                    1          0
6   China   27         1    Seo                    4          0

In [16]:
data.mean(axis=0)

age                    29.666667
new_user                0.833333
total_pages_visited     4.166667
converted               0.000000
dtype: float64

In [17]:
data.mean()

age                    29.666667
new_user                0.833333
total_pages_visited     4.166667
converted               0.000000
dtype: float64

In [18]:
data.mean(axis=1)

1     7.25
2     8.25
3    11.25
4     9.25
5     8.00
6     8.00
dtype: float64

# String methods in pandas

In [19]:
Data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

In [22]:
Data.source.str.upper().head()

0    ADS
1    SEO
2    SEO
3    SEO
4    SEO
Name: source, dtype: object

In [24]:
Data.source.str.contains("Se").head()

0    False
1     True
2     True
3     True
4     True
Name: source, dtype: bool

# Change datatype in pandas

In [25]:
Data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                    1          0
1      US   23         1    Seo                    5          0
2      US   28         1    Seo                    4          0
3   China   39         1    Seo                    5          0
4      US   30         1    Seo                    6          0

In [26]:
Data.dtypes

country                object
age                     int64
new_user                int64
source                 object
total_pages_visited     int64
converted               int64
dtype: object

In [27]:
Data["total_pages_visited"]=Data.total_pages_visited.astype(float)

In [28]:
Data.dtypes

country                 object
age                      int64
new_user                 int64
source                  object
total_pages_visited    float64
converted                int64
dtype: object

In [30]:
Data=pd.read_csv("CRO.csv",dtype={"total_pages_visited":float})

In [31]:
Data.dtypes

country                 object
age                      int64
new_user                 int64
source                  object
total_pages_visited    float64
converted                int64
dtype: object

In [35]:
Data.source.str.contains("Se").head()

0    False
1     True
2     True
3     True
4     True
Name: source, dtype: bool

In [36]:
Data.source.str.contains("Se").astype(int).head()

0    0
1    1
2    1
3    1
4    1
Name: source, dtype: int32

# Group by in pandas

In [37]:
Data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                  1.0          0
1      US   23         1    Seo                  5.0          0
2      US   28         1    Seo                  4.0          0
3   China   39         1    Seo                  5.0          0
4      US   30         1    Seo                  6.0          0

In [38]:
Data.groupby("country").mean()

               age  new_user  total_pages_visited  converted
country
China    30.672972  0.698520             4.553523   0.001332
Germany  30.449985  0.677237             5.190717   0.062500
UK       30.451538  0.679835             5.082167   0.052632
US       30.566482  0.681985             4.930160   0.037801

In [39]:
Data.groupby("country").age.mean()

country
China      30.672972
Germany    30.449985
UK         30.451538
US         30.566482
Name: age, dtype: float64

In [40]:
Data.groupby("country").age.max()

country
China       69
Germany    123
UK         111
US          79
Name: age, dtype: int64

In [41]:
Data.groupby("country").age.min()

country
China      17
Germany    17
UK         17
US         17
Name: age, dtype: int64

In [42]:
Data.groupby("country").age.agg(['count','mean','max'])

          count       mean  max
country
China     76602  30.672972   69
Germany   13056  30.449985  123
UK        48450  30.451538  111
US       178092  30.566482   79

# Explore pandas as series

In [43]:
Data.head()

  country  age  new_user source  total_pages_visited  converted
0      UK   25         1    Ads                  1.0          0
1      US   23         1    Seo                  5.0          0
2      US   28         1    Seo                  4.0          0
3   China   39         1    Seo                  5.0          0
4      US   30         1    Seo                  6.0          0

In [44]:
Data.dtypes

country                 object
age                      int64
new_user                 int64
source                  object
total_pages_visited    float64
converted                int64
dtype: object

In [45]:
Data.age.describe()

count    316200.000000
mean         30.569858
std           8.271802
min          17.000000
25%          24.000000
50%          30.000000
75%          36.000000
max         123.000000
Name: age, dtype: float64

In [48]:
Data.country.value_counts()# no of times repeated in dataframe

US         178092
China       76602
UK          48450
Germany     13056
Name: country, dtype: int64

In [50]:
Data.country.value_counts(normalize=True)#percentage of value appearance in the dataframe

US         0.563226
China      0.242258
UK         0.153226
Germany    0.041290
Name: country, dtype: float64

In [52]:
Data.country.unique()

array(['UK', 'US', 'China', 'Germany'], dtype=object)

In [55]:
pd.crosstab(Data.country,Data.source)

source     Ads  Direct    Seo
country
China    21561   17463  37578
Germany   3760    2864   6432
UK       13518   11131  23801
US       49901   40962  87229

In [56]:
Data.country.describe()

count     316200
unique         4
top           US
freq      178092
Name: country, dtype: object

# Handling Missing values in pandas

In [57]:
sample=pd.read_csv("Sample data.csv")

In [58]:
sample

    Name   Age      sal group
0   sree  32.0  10000.0     F
1  kumar   NaN  20000.0     G
2   raju  56.0      NaN     H
3   hari   NaN  33222.0     L
4  kummu  56.0      NaN     M

In [59]:
sample.tail(1)

    Name   Age  sal group
4  kummu  56.0  NaN     M

In [60]:
sample.head(1)

   Name   Age      sal group
0  sree  32.0  10000.0     F

In [61]:
sample.isnull()

    Name    Age    sal  group
0  False  False  False  False
1  False   True  False  False
2  False  False   True  False
3  False   True  False  False
4  False  False   True  False

In [62]:
sample.notnull()

   Name    Age    sal group
0  True   True   True  True
1  True  False   True  True
2  True   True  False  True
3  True  False   True  True
4  True   True  False  True

In [63]:
sample.notnull().sum()

Name     5
Age      3
sal      3
group    5
dtype: int64

In [64]:
sample.notnull().sum(axis=0)

Name     5
Age      3
sal      3
group    5
dtype: int64

In [65]:
sample.notnull().sum(axis=1)

0    4
1    3
2    3
3    3
4    3
dtype: int64

In [66]:
sample[sample.Age.isnull()]

    Name  Age      sal group
1  kumar  NaN  20000.0     G
3   hari  NaN  33222.0     L

In [67]:
sample.shape

(5, 4)

In [68]:
sample.dropna(how="any")#drop a row if any value is null

   Name   Age      sal group
0  sree  32.0  10000.0     F

In [70]:
sample.dropna(how="all")#drop a row if all values are null

    Name   Age      sal group
0   sree  32.0  10000.0     F
1  kumar   NaN  20000.0     G
2   raju  56.0      NaN     H
3   hari   NaN  33222.0     L
4  kummu  56.0      NaN     M

In [72]:
sample.dropna(subset=["Age","Name"],how="any")

    Name   Age      sal group
0   sree  32.0  10000.0     F
2   raju  56.0      NaN     H
4  kummu  56.0      NaN     M

In [73]:
sample.dropna(subset=["Age","Name"],how="all")

    Name   Age      sal group
0   sree  32.0  10000.0     F
1  kumar   NaN  20000.0     G
2   raju  56.0      NaN     H
3   hari   NaN  33222.0     L
4  kummu  56.0      NaN     M

In [75]:
sample["Age"].value_counts(dropna=False)

 56.0    2
NaN      2
 32.0    1
Name: Age, dtype: int64

In [78]:
sample["Age"].fillna(34)

0    32.0
1    34.0
2    56.0
3    34.0
4    56.0
Name: Age, dtype: float64